[Killed] BlockStatement
uc-vvs/mutation-test/src/income-tax.ts:6:54
 // se 1000 < salário-base <= 2000, IR = (salário-base - 1000) * 15%
 // se salário-base <= 1000, IR = 0
 
-export function calculateTax(salary: number): number {
-  if (salary > 2000.0) {
-    return (150 + (salary - 2000.0) * (0.20))
-  }
-
-  if (salary > 1000.0) {
-    return ((salary - 1000.0) * (0.15))
-  }
-
-  return 0.0
-}
+export function calculateTax(salary: number): number {}
 

[Killed] EqualityOperator
uc-vvs/mutation-test/src/income-tax.ts:7:7
 // se salário-base <= 1000, IR = 0
 
 export function calculateTax(salary: number): number {
-  if (salary > 2000.0) {
+  if (salary <= 2000.0) {
     return (150 + (salary - 2000.0) * (0.20))
   }

[Killed] ConditionalExpression
uc-vvs/mutation-test/src/income-tax.ts:7:7
 // se salário-base <= 1000, IR = 0
 
 export function calculateTax(salary: number): number {
-  if (salary > 2000.0) {
+  if (false) {
     return (150 + (salary - 2000.0) * (0.20))
   }

[Killed] ArithmeticOperator
uc-vvs/mutation-test/src/income-tax.ts:8:19
 
 export function calculateTax(salary: number): number {
   if (salary > 2000.0) {
-    return (150 + (salary - 2000.0) * (0.20))
+    return (150 + (salary - 2000.0) / 0.20)
   }
 

[Killed] ArithmeticOperator
uc-vvs/mutation-test/src/income-tax.ts:8:13
 
 export function calculateTax(salary: number): number {
   if (salary > 2000.0) {
-    return (150 + (salary - 2000.0) * (0.20))
+    return (150 - (salary - 2000.0) * 0.20)
   }
 

[Killed] ConditionalExpression
uc-vvs/mutation-test/src/income-tax.ts:11:7
     return (150 + (salary - 2000.0) * (0.20))
   }
 
-  if (salary > 1000.0) {
+  if (true) {
     return ((salary - 1000.0) * (0.15))
   }

[Killed] BlockStatement
uc-vvs/mutation-test/src/income-tax.ts:11:24
     return (150 + (salary - 2000.0) * (0.20))
   }
 
-  if (salary > 1000.0) {
-    return ((salary - 1000.0) * (0.15))
-  }
+  if (salary > 1000.0) {}
 
   return 0.0

[Killed] ArithmeticOperator
uc-vvs/mutation-test/src/income-tax.ts:12:13
   }
 
   if (salary > 1000.0) {
-    return ((salary - 1000.0) * (0.15))
+    return ((salary - 1000.0) / 0.15)
   }
 

[Killed] ArithmeticOperator
uc-vvs/mutation-test/src/income-tax.ts:12:14
   }
 
   if (salary > 1000.0) {
-    return ((salary - 1000.0) * (0.15))
+    return ((salary + 1000.0) * (0.15))
   }
 
